return {
  "akinsho/bufferline.nvim",
  opts = {
    options = {
      -- Принудительно показывать панель вкладок, даже если открыт всего 1 файл
      always_show_bufferline = true,

      -- Встроенный способ показывать "папка/файл", если открыты два файла с одинаковым именем
      -- Работает мгновенно из коробки, без ручного поиска .git на диске
      mode = "unique_subdirectory",

      -- Ваши старые базовые настройки внешнего вида
      padding = 1,
      max_name_length = 100,
    },
  },
}
